ado.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-06-09 Thu 14:23 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Azure DevOps</title>
<meta name="author" content="Søren Lund" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="preamble" class="status">
<!-- begin: html/preamble.html -->
<header>
<h1>Bookmarks</h1>
<nav>
<a href="index.html">Home</a> ❙
<a href="incoming.html">Incoming</a> ❙
<a href="about.html">About</a>
</nav>
</header>
<!-- end: html/preamble.html -->
</div>
<div id="content" class="content">
<h1 class="title">Azure DevOps</h1>

<div id="outline-container-org6c28745" class="outline-2">
<h2 id="org6c28745">About Azure DevOps</h2>
<div class="outline-text-2" id="text-org6c28745">
<p>
<a href="https://azure.microsoft.com/services/devops/">Azure DevOps</a> (ADO) is a suite of online tools to support the entire
lifecycle of a software project, including version control,
automated pipelines for building and testing, task and issue
tracking, documentaton, and more.
</p>
</div>

<div id="outline-container-org1374216" class="outline-3">
<h3 id="org1374216">Azure Pipelines</h3>
<div class="outline-text-3" id="text-org1374216">
<ul class="org-ul">
<li><a href="https://docs.microsoft.com/en-us/azure/devops/pipelines/yaml-schema?view=azure-devops&amp;tabs=schema%2Cparameter-schema">YAML schema</a> — complete reference to YAML pipelines</li>
<li><a href="https://docs.microsoft.com/en-us/azure/devops/pipelines/process/expressions?view=azure-devops">Expressions</a> — guide to using expressions in e.g. conditions</li>
<li><a href="https://docs.microsoft.com/en-us/azure/devops/pipelines/build/variables?view=azure-devops&amp;tabs=yaml">Predefined Variables</a> — list of all predefined variables</li>
<li><a href="https://docs.microsoft.com/en-us/azure/devops/pipelines/process/templates?view=azure-devops">Templates</a> — guide to using templates</li>
</ul>
</div>

<div id="outline-container-orgdbc948c" class="outline-4">
<h4 id="orgdbc948c">How-tos</h4>
<div class="outline-text-4" id="text-orgdbc948c">
<ul class="org-ul">
<li><a href="https://stackoverflow.com/questions/56541458/azure-pipeline-doest-allow-to-git-push-throwing-genericcontribute-permission">Fixing 'GenericContribute' permission is needed error when executing a git push</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orge6410fa" class="outline-3">
<h3 id="orge6410fa">Azure Repos</h3>
<div class="outline-text-3" id="text-orge6410fa">
<ul class="org-ul">
<li><a href="https://objectsharp.com/blog/how-to-restore-a-deleted-azure-repo">How to restore a deleted Azure Repo</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer>
<p>&copy; 2021 Søren Lund</p>
</footer>
</div>
</body>
</html>
